{
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 14,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 8,
  "peft_type": "PROMPT_TUNING",
  "peft_version": "0.18.1",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Create a cooking recipe:",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 896,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct"
}